artilleryLoadTest.yml
config:
  target: 'http://ec2-54-183-17-231.us-west-1.compute.amazonaws.com'
  phases:
    - duration: 20
      arrivalRate: 10
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
  processor: "./artilleryScript.js"
scenarios:
  - name: "Submit GET requests for random listings"
    flow:
    - function: "loadTestScript"
    - loop:
      - get:
          url: "/{{ listing_id }}"
      count: 5

    # Print data for every req
    # - log: "Sent a request to /listing_id with {{ listing_id }}"