loadtest.yml
config:
  target: 'http://127.0.0.1:3000'
  http:
    pool: 10
  phases:
    - duration: 5
      arrivalRate: 10
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "images"
    flow:
    - loop:
      - get:
          url: "/{{ $loopCount }}"
          count: 1